---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyDataSettings
source: html/9108112c-330d-d570-f461-01bf62cb0d0f.htm
---
# EnergyDataSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.